{
    "id": "/music/build-your-home-studio",
    "title": "Build your music home studio...",
    "subtitle": "How to build a decent home studio?",
    "blurb": "Building a home studio can be very challenging, but a good rule of thumb is first to identify what are you going to use your home studio for? Such as podcast? Live stream?  Music production? This post will guide you to choose a decent hardware for your home studio to start getting creative!",
    "content": "<div> <h4>About This Post</h4> <div>Thank you for giving your time to ready our blog post, and we hope that you find it helpful to build your home studio and consider buying your gears from our affiliate links to support our site, and help us to post more helpful content for our users! <br/><br/> In general, it can be difficult and confusing to know where to start from in order to build a decent home studio, but identifying what are you going to use your home studio for is the very first thing to know in order to be on the right track. The next important part of the decision is to know what are the fundamental gears that make up your home studio, and what is the purpose of each gear. However, we will list three levels of each gear from simpler/cheaper to more expensive option that way you will have better understanding of what to buy.</div> </div> <p><br /><br /></p> <div> <h4>Identify the use case of your home studio</h4> <div>What are you using your home studio for? Knowing what you are using your studio for is important, because it can help you budget your gears accordingly. Some examples are such as live streaming, podcast, or music production. If you are using your studio just to do some podcasting, then you don&rsquo;t need an <a target=\"_blank\" href=\"https://amzn.to/3oLGGvW\">audio interface</a> that has lots of ins and outs, but if you don&rsquo;t have the answer for this question, then no worries as this blog post will still help you to build a decent home studio to use it for different scenarios.</div> <br /><br /> <div> <h4>Fundamental gears</h4> <div>No matter what type of studio you are building such as a home or professional studio, you will need these components that will be listed below, but more importantly, the main brain of any type of studio is the computer. However, choosing a computer is whole another topic that we addressed in this blog, as it can affect the budget greatly, but our advice at the moment will be to use what you currently have, and see if it will work, only after that, you can decide if you should shop for new computer for your studio.</div> </div> <ul> <li>Computers: <a target=\"_blank\" href=\"/blogs/music/home-studio-computer\">Follow this blog post</a></li> <li><a target=\"_blank\" href=\"https://amzn.to/3oLGGvW\">Audio Interface</a>&nbsp;<br /> <p>Audio interface is one of the core components in any studio. Its role is to convert analog signal to digital signal and other way around to off load some of the heavy work from the computer processor.&nbsp; Our top recommendation for audio interface will be in these 3 brands: any of the <a target=\"_blank\" href=\"https://amzn.to/3WQLbBT\">Steinberg UR</a> models, <a target=\"_blank\" href=\"https://amzn.to/3MP1JWq\">MOTU M</a> models, or <a target=\"_blank\" href=\"https://amzn.to/3NeqSeF\">Focusrite Scarlett</a> models. If you don&rsquo;t need lots of input and output you can get: 1- <a target=\"_blank\" href=\"https://amzn.to/3NcmyMQ\">Focusrite Scarlett 2i2</a>, or 2- <a target=\"_blank\" href=\"https://amzn.to/43n6RIq\">Steinberg UR 22C</a>, or 3- <a target=\"_blank\" href=\"https://amzn.to/3NbLWCn\">MOTU M4</a>.&nbsp; You can review the options of each of these brands based on your need and budget in terms of inputs and outputs, but the price rang for them is between $180-$400. For sure there are more expensive models than this price range, but keep in mind that the target of this blog post is to help you build a decent home studio that can be good enough and solid to last you for long time, and its not supper expensive to build.</p> </li> <li><a target=\"_blank\" href=\"https://amzn.to/3WQvPNR\">Midi Keyboard</a><br /> <p>You will need a midi keyboard to play VST instruments such as piano and more, and this part is where you can cut some for the cost and get a midi keyboard as low maybe around $70. However, if you are a piano player then you might not get along with cheaper midi keyboards, in that case you will need to have a budget allocated for this somewhere from $500 to $1000 in order to have fully weighted midi keyboard . Our recommendation for this will be one of these models: 1- <a target=\"_blank\" href=\"https://amzn.to/3OOJiUq\">M-Audio Keystation 61 MK3</a>, 2- <a target=\"_blank\" href=\"https://amzn.to/3qmaMGF\">Native Instruments Komplete Kontrol A61</a>, 3-<a target=\"_blank\" href=\"https://amzn.to/43F9W69\"> Arturia KeyLab Essential 88</a> or <a target=\"_blank\" href=\"https://amzn.to/43Fa1GZ\">Native Instruments Komplete Kontrol S88</a></p> </li> <li><a target=\"_blank\" href=\"https://amzn.to/3MTtFIC\">Speaker Monitors</a><br /> <p>The speaker monitors are used to do all your work to hear what you play or how you mixdown, it is important for the monitors to have a flat sound as possible in frequency range. Our recommendations will be in these three brands: <a target=\"_blank\" href=\"https://amzn.to/3MHALzK\">PreSonus</a>, <a target=\"_blank\" href=\"https://amzn.to/45MTjax\">KRK</a>, and <a target=\"_blank\" href=\"https://amzn.to/45NJoli\">Adam Audio.</a> The models you can check are 1- <a target=\"_blank\" href=\"https://amzn.to/45OGRaC\">PreSonus Eris E3</a>, <a target=\"_blank\" href=\"https://amzn.to/3MLzsjz\">KRK RP5 Rokit 5</a>, <a target=\"_blank\" href=\"https://amzn.to/3NbKu2J\">ADAM Audio T5V</a>.</p> </li> <li><a target=\"_blank\" href=\"https://amzn.to/3oKqc78\">Monitors</a><br /> <p>Monitors are expense that you can cut if your budget does not allow, but having at least one additional monitor (if you are using a laptop) it will be extremely helpful to speed up your work flow. Of course as high you go for the resolution and size more expensive the monitor will be, but unlike graphic designers, for music work there is no need to get super high resolution monitors.&nbsp; We recommend getting any of the monitors from these brands: <a target=\"_blank\" href=\"https://amzn.to/3oKqlHI\">Asus</a>, <a target=\"_blank\" href=\"https://amzn.to/3Cbff1D\">HP</a>, or <a target=\"_blank\" href=\"https://amzn.to/3NcYABe\">LG</a>.</p> </li> <li>Software<br /> <p>Having all these gears are not enough, you will need a software the uses all these to be able to do your recordings or streaming or any type of audio related work. Before buying any software, please check with the speaker monitors, or the audio interfaces as many of these can come with a free version of a professional software such as Cubase, or Ableton live. If there is no free option or if the free option was limited for you, we recommend buying the latest version of <a target=\"_blank\" href=\"https://amzn.to/3NdQ70H\">Cubase Artist</a> (for Windows), or Logic Pro (for Mac).</p></li><li>Microphones <p>There are tons of microphones that you can get, but to be more practical we recommend to get <a href=\"https://amzn.to/43ZFxjt\" target=\"_blank\"> Shure SM 57</a> for acoustic instrument recording, and for vocals recording we recommend <a href=\"https://amzn.to/3qsi1wZ\" target=\"_blank\"> Audio-Technica AT2035</a>, and how many of these microphones you want to get will depends on how many instruments and vocals you will need to record simultaneously.</p></li> <li><a target=\"_blank\" href=\"https://amzn.to/3Ncl7On\">Desk</a> and <a target=\"_blank\" href=\"https://amzn.to/3oLHGAc\">Chair</a> <br /> <p>We are listing the Desk and chair in this post just to have it on the list of your checkbox, but this is all subject to you on what type of desk and chair you want to get. Specially the chair that is something you will need to try it to feel comfortable sitting on it for a long time.</p> &nbsp;<br /><br /></li> </ul> </div>",
    "heroimageurl": "/Images/home-studio-hero.jpg",
    "metadata":{
        "browsertitle": "Blogs: Build your home studio!",
        "keyword": "home studio, studio, recording, recording studio, music, live stream, podcast, YouTube, broadcast, music production",
        "description": "How to build a decent recording studio"
    }
}