{
    "title": "Which Computer I should buy?",
    "subtitle": "",
    "blurb": "So confusing.... What computer/hardware I should get? Mac? Windows? ram? hard drive?  Yes!! This all sounds confusing with thousands of options available to us, but this article will give you good knowledge on how to choose your home music studio gears!",
    "content": "<h2>What computer should I get for my home studio?</h2><p>Computer is the brain of any type of studio, and most of us if not all might already have a computer at home, therefore, my immediate advice will be is to use what you have first, and see if that&#39;s going to work, only after that start shopping for a computer if you need to, because, choosing the right computer can be overwhelming, especially for a beginner person because of many options available on the market. First thing you have to decide is the operating system (OS), should you get a Mac or windows? And the next thing to decide is the specifications of that computer. However, that is why we are here to help, and we hope that reading this blog post can be very helpful for you in order to make the right decision. </p><p></p><h3>Should I get a Mac Or Windows computer?</h3><p>The short answer for this question can be, if you are a Mac user get a Mac computer, and if you are a Windows user get a <a target=\"_blank\"  href=\"https://amzn.to/3qBXdmC\">Windows computer</a>, but yes, <a target=\"_blank\" class=\"c3\" href=\"https://amzn.to/3P3UXyA\">Mac computers</a>&nbsp;can be more reliable than windows computers, but windows computers also have come a long way, and they work much smoother and can be %100 reliable for music production and recording as well. However, for Windows computers, you have to be very selective of the brand you choose from, because not every Windows computer brand can be reliable, and for this reason, we definitely recommend you getting Lenovo as a brand, because in our own experience, Lenovo is very reliable and its kind of a Windows version of Mac; but of course for Mac, you can only get it from Apple and you can&#39;t go wrong with it, but for both options you will need to choose the right specifications for your computer.</p><p class=\"c4 c5\"><span class=\"c1\"></span></p><h3>Should I get a Laptop or Desktop?</h3><p>After choosing your computer OS, the next thing you should decide is if you should get a laptop or desktop. If your studio is not something you need to use it to record on the go, which most likely it isn&#39;t, then we recommend you get a desktop computer, and the reason for this is because desktop computers are usually easier to upgrade and add or remove things from it, so it can be more budget friendly for you on a long run, yet powerful. However, if you are looking to use your computer on the go by recording in different places or just doing some mixdown work using headphones at a coffee shop, then a laptop might fit better for you. Just to note that, for <a target=\"_blank\" href=\"https://amzn.to/3CjBdjd\">Lenovo laptops</a>&nbsp;we recommend you look for <a target=\"_blank\" href=\"https://www.lenovo.com/us/en/c/laptops/thinkpad/\">Thinkpad</a>&nbsp; series, and for desktop, look for <a target=\"_blank\" class=\"c3\" href=\"https://www.lenovo.com/us/en/c/workstations/thinkstation-p-series\">Lenovo Thinkstation</a>&nbsp;series. In Mac, for laptops, <a target=\"_blank\" href=\"https://amzn.to/3NoSQ7C\">Macbook Pro </a>is definitely the way to go, but for desktop Mac, <a target=\"_blank\" href=\"https://www.apple.com/mac-pro/\">Mac Pro</a>&nbsp;can be very expensive and you might not even need that level of power if you just using your studio for some simple recording or podcasting, and that is why we think <a target=\"_blank\" class=\"c3\" href=\"https://amzn.to/43OFOpd\">Mac Mini</a>&nbsp;or <a target=\"_blank\" class=\"c3\" href=\"https://www.apple.com/mac-studio/\">Mac Studio</a>&nbsp;can work perfectly instead of Mac Pro. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p><p></p><h3>What Specifications do I need for my computer? </h3><p>No matter which option you choose in terms of laptop or desktop, Mac or Windows, the specifications below will apply on all situation, and our recommendations are as follows: </p><p></p><ul><li><span>Minimum i7 Core Processor or M1/M2 for Mac</li><li>Minimum 32 GB RAM</li><li>Minimum &nbsp;512 SSD</li></ul><p></p><p>These specifications are the core of your computer, and the rest of the items, such as display/monitor, mouse and keyboard are all subjective to you based on what you prefer. &nbsp; </p><p></p><p>Hopefully by now you have a great idea for what type of computer you should get, and hope that this blog post was very informative to you, and you may consider buying from any of our affiliate links below and support our channel. </p><p></p><h3>Recommended models</h3><ul><li><a target=\"_blank\" class=\"c3\" href=\"https://amzn.to/3NjEXr8\">Lenovo Thinkpad P1</a></li><li><a target=\"_blank\" href=\"https://www.lenovo.com/us/en/c/workstations/thinkstation-p-series\">Lenovo Thinkstation </a></li><li><a target=\"_blank\" href=\"https://amzn.to/3P4cRRW\">Macbook Pro</a></li><li><a target=\"_blank\" href=\"https://www.apple.com/mac-studio/\">Mac Studio</a></li><li><a target=\"_blank\" href=\"https://amzn.to/42zhKFP\">Mac Mini </a>(if the use case is only minor edits or a podcast type of work)</li></ul>",
    "heroimageurl": "/Images/compters.jpg",
    "metadata":{
        "browsertitle": "Blogs: What Computer I should buy for my home studio?",
        "keyword": "home studio, Home recording, Audio engineering, Studio equipment, Soundproofing, home studio setup, Mixing and mastering, Digital audio workstation (DAW), Vocal recording",
        "description": "In this post, we will help and guide you to start your very first home studio based on your need"
    }
}